OpenDTEF-v2012/tutorials/combustion/reactingFoam/RAS/chokedNozzle/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    inletair
    {
        type            flowRateInletVelocity;
        value           $internalField;
        massFlowRate    csvFile;
        nHeaderLine     1;
        refColumn       0;
        componentColumns ( 1 );
        separator       ",";
        mergeSeparators no;
        file            "<constant>/inlet.csv";
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      $internalField;
        value           $internalField;
    }
    walls
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
